app/views/itineraries/show.html.erb

<% if @itinerary.archived == false %>
<% entries = @itinerary.entries.order(:date)%>
<% destinations = []%>
<% entries.each { |entry| destinations << entry.event.destination} %>
---
SELECT "entries".* FROM "entries" WHERE "entries"."itinerary_id" = $1 ORDER BY "entries"."date" ASC  [["itinerary_id", 1]]
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = $1 LIMIT $2  [["id", 127], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 127], ["LIMIT", 1]]

  <h2><%= link_to d.name, destination_path(d)%></h2>
  <% @itinerary.entries.order(:date).each do |entry|%>
    <% if Event.find(entry.event_id).destination_id == d.id%>
---
SELECT "entries".* FROM "entries" WHERE "entries"."itinerary_id" = $1 ORDER BY "entries"."date" ASC  [["itinerary_id", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 127], ["LIMIT", 1]]