app/controllers/application_controller.rb

    def current_user
        User.find_by(id: session[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]