app/controllers/destinations_controller.rb

    def index
        @user = User.find(session[:id])
        @countries = Destination.all.map {|d| d.country}.uniq
        @states = Destination.all.map {|d| d.state}.uniq
        if !params[:state].blank? && !params[:city].blank?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "destinations".* FROM "destinations"
SELECT "states".* FROM "states" INNER JOIN "cities" ON "states"."id" = "cities"."state_id" WHERE "cities"."id" = $1 LIMIT $2  [["id", 87], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."state_id" = $1  [["state_id", 33]]

    def show
        @destination = Destination.find(params[:id])
        @itineraries = User.find(session[:id]).itineraries.where('archived = false')
        @entry = Entry.new
        @user = User.find(session[:id])
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."user_id" = $1 AND (archived = false)  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]