app/controllers/favorites_controller.rb

    def index
        if params[:user_id]
            if User.find_by(id: params[:user_id]).nil?
                redirect_to User.find(session[:id])
            else
                @favorites = User.find(session[:id]).favorites
            end
        else
             @favorites = User.find(session[:id]).favorites
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]

    def create
        # byebug
        @favorite = Favorite.create(favorite_params)
---
INSERT INTO "favorites" ("user_id", "destination_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["destination_id", 127], ["created_at", "2021-01-16 22:00:30.817057"], ["updated_at", "2021-01-16 22:00:30.817057"]]