app/controllers/itineraries_controller.rb

    def index
        if params[:user_id]
            if User.find_by(id: params[:user_id]).nil?
                redirect_to User.find(session[:id])
            else
                @itineraries = User.find(session[:id]).itineraries.where('archived = false')
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."user_id" = $1 AND (archived = false)  [["user_id", 1]]

    def show
        @user = User.find(session[:id])
        if params[:user_id]
            if Itinerary.find_by(id: params[:id], user_id: params[:user_id]).nil?
                flash[:alert] = ["Itinerary not found"]
                redirect_to user_itinerarys_path(User.find(params[:user_id]))
            else
                @itinerary = Itinerary.find_by(id: params[:id], user_id: params[:user_id])
            end
        else
            @itinerary = Itinerary.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @itinerary = Itinerary.new(itinerary_params)
        if @itinerary.save
---
INSERT INTO "itineraries" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "My birthday"], ["user_id", 1], ["created_at", "2021-01-16 22:00:41.513751"], ["updated_at", "2021-01-16 22:00:41.513751"]]

    def archived
        if params[:user_id]
            if User.find_by(id: params[:user_id]).nil?
                redirect_to User.find(session[:id])
            else
                @itineraries = User.find(session[:id]).itineraries.where('archived = true')
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."user_id" = $1 AND (archived = true)  [["user_id", 1]]