app/views/destinations/show.html.erb

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<br>
<% if !User.find(session[:id]).favorites.any? {|favorite| favorite.destination == @destination }%>

SELECT "events".* FROM "events" WHERE "events"."destination_id" = $1  [["destination_id", 6]]
---
    <% end %>
<% @destination.events.each do |event|%>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."destination_id" = $1 ORDER BY id DESC  [["destination_id", 6]]
---
  <tbody>
<% @destination.reviews.order('id DESC').each do | review | %>