app/views/layouts/destination_nav_page.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                <li class="nav-item">
                    <a class="nav-link page-scroll" href = "/users/<%= session[:id]%>">Hi, <%= User.find(session[:id]).name%></a>