app/views/layouts/nav_page.html.erb

                <li class="nav-item">
                    <a class="nav-link page-scroll" href = "/users/<%= session[:id]%>">Hi, <%= User.find(session[:id]).name%></a>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]