app/views/layouts/welcome_page.html.erb

                        <div class="text-container">
                            <h1> <span id="js-rotating">Hi, <%= User.find(session[:id]).name%></span></h1>
                            <br>
                            <a class="btn-solid-lg page-scroll" href="/destinations/<%= Destination.all[rand(1..190)].id%>">DISCOVER</a>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "destinations".* FROM "destinations"